
const weatherMap = {
  '晴':'晴',
  '少云':'少云',
  '晴间多云':'晴间多云',
  '多云':'多云',
  '阴':'阴',
  '有风':'和风',
  '平静':'和风',
  '和风':'和风',
  '清风':'小风',
  '微风':'小风',
  '强风/劲风':'大风',
  '疾风':'大风',
  '大风':'大风',
  '烈风':'大风',
  '风暴':'风暴',
  '狂暴风':'风暴',
  '飓风':'飓风',
  '热带风暴':'热带风暴',
  '霾':'霾',
  '中度霾':'霾',
  '重度霾':'霾',
  '严重霾':'霾',

  '阵雨':'雷阵雨',
  '雷阵雨':'雷阵雨',
  '雷阵雨并伴有冰雹':'雷阵雨',
  '小雨':'小雨',
  '毛毛雨/细雨':'小雨',
  '雨':'中雨',
  '中雨':'中雨',
  '大雨':'中雨',
  '小雨-中雨':'中雨',
  '中雨-大雨':'中雨',
  '暴雨':'极端降雨',
  '大暴雨':'极端降雨',
  '极端降雨':'极端降雨',
  '大雨-暴雨':'极端降雨',
  '强阵雨':'强阵雨',
  '强雷阵雨':'强阵雨',
  '特大暴雨':'特大暴雨',
  '大暴雨-特大暴雨':'特大暴雨',
  '暴雨-大暴雨':'特大暴雨',
  '大暴雨-特大暴雨':'特大暴雨',
  '冻雨':'冻雨',

  '雨雪天气':'雨夹雪',
  '雨夹雪':'雨夹雪',
  '阵雨夹雪':'雨夹雪',

  '雪':'雪',
  '小雪':'雪',
  '中雪':'雪',
  '小雪-中雪':'雪',
  '阵雪':'阵雪',
  '大雪':'大雪',
  '暴雪':'大雪',
  '中雪-大雪':'大雪',
  '大雪-暴雪':'大雪',
  '浮尘':'浮尘',
  '扬沙':'扬沙',
  '沙尘暴':'沙尘暴',
  '强沙尘暴':'沙尘暴',
  '龙卷风':'龙卷风',
  '雾':'雾',
  '轻雾':'雾',
  '大雾':'雾',
  '浓雾':'浓雾', 
  '强浓雾':'浓雾', 
  '特强浓雾':'特强浓雾', 
  '未知':'未知', 
};


const weatherBGMap = {
  '晴':{name:'晴',color:'#FF7835'},
  '少云':{name:'少云',color:'#5F99F2'},
  '晴间多云':{name:'晴间多云',color:'#5F99F2'},
  '多云':{name:'多云',color:'#5F99F2'},
  '阴':{name:'阴',color:'#768CAA'},
  '有风':{name:'多云',color:'#5F99F2'},
  '平静':{name:'多云',color:'#5F99F2'},
  '和风':{name:'多云',color:'#5F99F2'},
  '清风':{name:'多云',color:'#5F99F2'},
  '微风':{name:'多云',color:'#5F99F2'},
  '强风/劲风':{name:'多云',color:'#5F99F2'},
  '疾风':{name:'多云',color:'#5F99F2'},
  '大风':{name:'多云',color:'#5F99F2'},
  '烈风':{name:'多云',color:'#5F99F2'},
  '风暴':{name:'多云',color:'#5F99F2'},
  '狂暴风':{name:'多云',color:'#5F99F2'},
  '飓风':{name:'多云',color:'#5F99F2'},
  '热带风暴':{name:'多云',color:'#5F99F2'},

  '霾':{name:'霾',color:'#8F8978'},
  '中度霾':{name:'霾',color:'#8F8978'},
  '重度霾':{name:'霾',color:'#8F8978'},
  '严重霾':{name:'霾',color:'#8F8978'},

  '阵雨':{name:'小雨',color:'#768CAA'},
  '雷阵雨':{name:'雷雨',color:'#768CAA'},
  '雷阵雨并伴有冰雹':{name:'雷雨',color:'#768CAA'},
  '小雨':{name:'小雨',color:'#768CAA'},
  '毛毛雨/细雨':{name:'小雨',color:'#768CAA'},
  '雨':{name:'小雨',color:'#768CAA'},
  '中雨':{name:'小雨',color:'#768CAA'},
  '大雨':{name:'小雨',color:'#768CAA'},
  '小雨-中雨':{name:'小雨',color:'#768CAA'},
  '中雨-大雨':{name:'大雨',color:'#768CAA'},

  '暴雨':{name:'大雨',color:'#768CAA'},
  '大暴雨':{name:'大雨',color:'#768CAA'},
  '极端降雨':{name:'特大暴雨',color:'#768CAA'},
  '大雨-暴雨':{name:'大雨',color:'#768CAA'},
  '强阵雨':{name:'大雨',color:'#768CAA'},
  '强雷阵雨':{name:'雷雨',color:'#768CAA'},
  '特大暴雨':{name:'大雨',color:'#768CAA'},
  '大暴雨-特大暴雨':{name:'特大暴雨',color:'#768CAA'},
  '暴雨-大暴雨':{name:'大雨',color:'#768CAA'},
  '大暴雨-特大暴雨':{name:'特大暴雨',color:'#768CAA'},
  '冻雨':{name:'大雨',color:'#768CAA'},

  '雨雪天气':{name:'雨夹雪',color:'#6F96CA'},
  '雨夹雪':{name:'雨夹雪',color:'#6F96CA'},
  '阵雨夹雪':{name:'雨夹雪',color:'#6F96CA'},
  
  '雪':{name:'小雪',color:'#6F96CA'},
  '小雪':{name:'小雪',color:'#6F96CA'},
  '中雪':{name:'小雪',color:'#6F96CA'},
  '小雪-中雪':{name:'小雪',color:'#6F96CA'},
  '阵雪':{name:'小雪',color:'#6F96CA'},
  '大雪':{name:'大雪',color:'#768CAA'},
  '暴雪':{name:'大雪',color:'#768CAA'},
  '中雪-大雪':{name:'大雪',color:'#768CAA'},
  '大雪-暴雪':{name:'大雪',color:'#768CAA'},

  '浮尘':{name:'扬沙',color:'#8E7963'},
  '扬沙':{name:'扬沙',color:'#8E7963'},
  '沙尘暴':{name:'沙尘暴',color:'#A07938'},
  '强沙尘暴':{name:'沙尘暴',color:'#A07938'},
  '龙卷风':{name:'沙尘暴',color:'#A07938'},

  '雾':{name:'轻雾',color:'#A0BBE5'},
  '轻雾':{name:'轻雾',color:'#A0BBE5'},
  '大雾':{name:'大雾',color:'#A0BBE5'},
  '浓雾':{name:'大雾',color:'#A0BBE5'},
  '强浓雾':{name:'大雾',color:'#A0BBE5'},
  '特强浓雾':{name:'大雾',color:'#A0BBE5'},
}



const getImg = (str) =>{
  return weatherMap[str]?`${weatherMap[str]}@3x.png`:''
}
const getBG = (str) =>{
  if(weatherBGMap[str]){
    const obj = weatherBGMap[str];
    return {
      img:`${obj.name}-image.png`,
      color: obj.color
    }
  }
  return null
}


export default {
  getImg,
  getBG
};